app/controllers/administrator_controller.rb

def index
  @hotels = Hotel.find(:all)
  @rooms2 = Room.sum(:total_rooms)
  @rooms = Room.count
  @users = User.count
  @numhotels = Hotel.count
---
SELECT sum("rooms".total_rooms) AS sum_total_rooms FROM "rooms"
SELECT count(*) AS count_all FROM "users"
SELECT count(*) AS count_all FROM "hotels"