app/controllers/hotels_controller.rb

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT * FROM "hotels" WHERE ("hotels"."id" = 4)