app/controllers/photos_controller.rb

  def create
    @hotel = Hotel.find(params[:hotel_id])
    @photo = Photo.new(params[:photo])

    if @photo.save
---
SELECT * FROM "hotels" WHERE ("hotels"."id" = 1)
INSERT INTO "photos" ("size", "created_at", "title", "content_type", "thumbnail", "updated_at", "parent_id", "height", "filename", "hotel_id", "width") VALUES(1399967, '2009-02-26 07:03:04', 'nueva', 'image/jpeg', NULL, '2009-02-26 07:03:04', NULL, 500, '13.jpg', NULL, 800)

  def destroy
    _find_album
    @photo = @album.photos.find(params[:id])
    @photo.destroy
---
SELECT * FROM "photos" WHERE ("photos"."id" = 6 AND ("photos".hotel_id = 1))
DELETE FROM "photos" WHERE "id" = 7