app/controllers/rooms_controller.rb

SELECT * FROM "hotels" WHERE ("hotels"."id" = 4)
---
  def index
    @hotel = Hotel.find(params[:hotel_id])