app/controllers/users_controller.rb

SELECT * FROM "users" WHERE (login != 'superadmin') ORDER BY name
---
  def index
    @users = User.find(:all, :order => "name", :conditions => ["login != ?", "superadmin"])

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'd2607a9c440f8b4ea54e5cfaf68173805a296c9d', '2009-02-26 06:55:42', 'cc7a8f93cbedd57a85445adc4352974da7eccdec', NULL, '2009-02-26 06:55:42', NULL, 'ismael', 'ismael@gmail.com')
---
  def create
    #No quiero que se salga del administrador cuando crea un nuevo usuario.
    #logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save